#pragma once

static const double MINIMAL_OBJECT_UPDATE_INTERVALE = 0.03;//in sec

/*
сделать генерацию скал более разнообразной, выбирать 3 точки и рисать между ними линию
(определяем по расстоянию смешаться в сторону или вверх, потом определяем в этой точке косая палка или прямая)

зациклить карту
уменьшить ее длинну

а что если доделать систему время зависимого апдейта так, чтоб
каждый апдейт смещение объектов было, но не значительным,
на 1 секунда поделить на колличество возможных входов в секунду, 
а апдейтбл переименовать в таймер и использовать для временных изменений
(частота стрельбы в секнду, частота обновления графики или физики)

сделать стартовое меню, сейвы, конфиги

врагов
*/